_site/boj-13977/index.html
<div id="outline-container-orgf947972" class="outline-2">
<h2 id="orgf947972">BOJ 13977 이항계수와 쿼리</h2>
<div class="outline-text-2" id="text-orgf947972">
<ul class="org-ul">
<li>pow(base, cnt)를 구하기</li>
</ul>
</div>
</div>

<div id="outline-container-orgd5ea8cd" class="outline-2">
<h2 id="orgd5ea8cd">접근하기</h2>
<div class="outline-text-2" id="text-orgd5ea8cd">
<ul class="org-ul">
<li>factorial을 400만 크기로 미리 계산한다.</li>
<li>페르마의 소정리를 이용해 이항계수 구한다.</li>
</ul>
</div>
</div>

<div id="outline-container-org570f4fc" class="outline-2">
<h2 id="org570f4fc">코드 - 페르마의 소정리, 직접 계산 (144 m/s)</h2>
<div class="outline-text-2" id="text-org570f4fc">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>

<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">MOD</span> 1000000007
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">M</span>, <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">K</span>;

<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">fact</span>[4000040];

<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #edd400; font-weight: bold;">pow</span>(<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">base</span>, <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">cnt</span>)
{
        <span style="color: #729fcf; font-weight: bold;">if</span> (cnt == 0) <span style="color: #729fcf; font-weight: bold;">return</span> 1;
        <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">tmp</span> = pow(base, cnt/2) %MOD;

        <span style="color: #729fcf; font-weight: bold;">if</span> (cnt%2) {
                <span style="color: #729fcf; font-weight: bold;">return</span> ((tmp * tmp) % MOD * base% MOD)% MOD;
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
                <span style="color: #729fcf; font-weight: bold;">return</span> (tmp * tmp) % MOD;
        }
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
        fact[0] = 1;
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=4000000;i++) {
                fact[i] = fact[i-1]%MOD * i;
                fact[i] %= MOD;
        }

        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;M);
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;M;i++) {
                scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;N, &amp;K);
                <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">ans</span> = (fact[N] * pow((fact[N-K]*fact[K])%MOD, MOD-2))%MOD;
                printf(<span style="color: #ad7fa8; font-style: italic;">"%lld\n"</span>, ans%MOD);
        }
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org04b21db" class="outline-2">
<h2 id="org04b21db">코드 - inverse 미리 구해서 가져옴 (163 m/s)</h2>
<div class="outline-text-2" id="text-org04b21db">
<ul class="org-ul">
<li>역원을 400만부터 거슬러서 미리 table에 넣어둘 수 있음</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>

<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">MOD</span> 1000000007
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">M</span>, <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">K</span>;

<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">fact</span>[4000040];
<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">inv</span>[4000040];

<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #edd400; font-weight: bold;">pow</span>(<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">base</span>, <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">cnt</span>)
{
        <span style="color: #729fcf; font-weight: bold;">if</span> (cnt == 0) <span style="color: #729fcf; font-weight: bold;">return</span> 1;
        <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">tmp</span> = pow(base, cnt/2) %MOD;

        <span style="color: #729fcf; font-weight: bold;">if</span> (cnt%2) {
                <span style="color: #729fcf; font-weight: bold;">return</span> ((tmp * tmp) % MOD * base% MOD)% MOD;
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
                <span style="color: #729fcf; font-weight: bold;">return</span> (tmp * tmp) % MOD;
        }
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
        freopen(<span style="color: #ad7fa8; font-style: italic;">"input.txt"</span>, <span style="color: #ad7fa8; font-style: italic;">"r"</span>, stdin);
        fact[0] = 1;

        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=4000000;i++) {
                fact[i] = fact[i-1]%MOD * i;
                fact[i] %= MOD;
        }
        inv[4000000] = pow(fact[4000000], MOD-2) %MOD;
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=4000000-1;i&gt;=0;i--) {
                inv[i] = (inv[i+1] * (i+1))%MOD;
        }
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;M);
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;M;i++) {
                scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;N, &amp;K);
                <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">ans</span> = fact[N] % MOD;
                ans = (ans * inv[K] % MOD) % MOD;
                ans = (ans * inv[N-K] % MOD) % MOD;

                printf(<span style="color: #ad7fa8; font-style: italic;">"%lld\n"</span>, ans);
        }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3f4523c" class="outline-2">
<h2 id="org3f4523c">문제 링크</h2>
<div class="outline-text-2" id="text-org3f4523c">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/13977">https://www.acmicpc.net/problem/13977</a></li>
</ul>
</div>
</div>
